public enum TypeOfSeasonTicket {
    Total,        // Тренажёрный зал + групповые занятия, в любое время
    FullAm,       // Тренажёрный зал + групповые занятия, до 16.00
    FullPm,       // Тренажёрный зал + групповые занятия, с 16.00
    Gym,          // Тренажёрный зал, в любое время
    GymAm,        // Тренажёрный зал, до 16.00
    GymPm,        // Тренажёрный зал, с 16.00
    Group,        // Групповые занятия, в любое время
    GroupAm,      // Групповые занятия, до 16.00
    GroupPm,       // Групповые занятия, с 16.00
    Non
}
